src/Documents/ОтчетКомиссионераОСписании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ОтчетКомиссионераОСписании</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РасходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗапасыПереданныеВРазрезеГТД</xr:Item>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыВРазрезеГТД</xr:Item>
				<xr:Item>InformationRegister.ОперацииСПрослеживаемымиТоварами</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыПереданные</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерииНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПодписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямоеСписаниеГТД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерииНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РНПТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>26</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ЗагрузкаДанныхИзВнешнегоИсточникаКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, Владелец) Экспорт
	
	Если СтрНайти(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников, "ЗагрузкаДанныхИзФайла") > 0 Тогда
		
		ПараметрыЗагрузкиДанных = НастройкиЗагрузкиДанных;
		
	ИначеЕсли СтрНайти(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников, "ЗагрузкаДанныхИзВнешнегоИсточника") > 0 Тогда
		
		ПараметрыЗагрузкиДанных = Новый Структура("НастройкиЗагрузкиДанных", НастройкиЗагрузкиДанных);
		
	КонецЕсли;
	
	ОткрытьФорму(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников, ПараметрыЗагрузкиДанных, Владелец, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Функция НастройкиЗагрузкиWildberriesОтчетОПродажах() Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ИмяТабличнойЧасти", "Запасы");
	ЗначенияЗаполнения.Вставить("Наименование", "Wildberries - отчет о продажах");
	ЗначенияЗаполнения.Вставить("ОбъектЗагрузки", "Документ.ОтчетКомиссионера");
	ЗначенияЗаполнения.Вставить("Пользователь", ПользователиКлиент.АвторизованныйПользователь());
	массивСтрок = Новый Массив;
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Номенклатура", "Номенклатура", 2));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Артикул", "Артикул", 3));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Характеристика", "Характеристика", 6));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Штрихкод", "Штрихкод", 7));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Количество", "Количество", 9));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "СтавкаНДС", "Ставка НДС", 10));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "СуммаПередачи", "Сумма передачи", 13));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "ЦенаПередачи", "Цена передачи", 24));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Сумма", "Сумма", 25));
	
	ЗначенияЗаполнения.Вставить("СоответствияПолей", массивСтрок);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

Функция НастройкиЗагрузкиWildberriesВозвратОтКомиссионера() Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ИмяТабличнойЧасти", "Запасы");
	ЗначенияЗаполнения.Вставить("Наименование", "Wildberries - возврат от комиссионера");
	ЗначенияЗаполнения.Вставить("ОбъектЗагрузки", "Документ.ПриходнаяНакладная");
	ЗначенияЗаполнения.Вставить("Пользователь", ПользователиКлиент.АвторизованныйПользователь());
	массивСтрок = Новый Массив;
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Номенклатура", "Номенклатура", 2));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Артикул", "Артикул", 3));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Характеристика", "Характеристика", 6));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Штрихкод", "Штрихкод", 7));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Количество", "Количество", 9));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "СтавкаНДС", "Ставка НДС", 10));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Сумма", "Сумма", 25));
	
	ЗначенияЗаполнения.Вставить("СоответствияПолей", массивСтрок);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

Функция НастройкиЗагрузкиWildberriesОтчетКомиссионераОСписании() Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ИмяТабличнойЧасти", "Запасы");
	ЗначенияЗаполнения.Вставить("Наименование", "Wildberries - отчет комиссионера о списании");
	ЗначенияЗаполнения.Вставить("ОбъектЗагрузки", "Документ.ОтчетКомиссионераОСписании");
	ЗначенияЗаполнения.Вставить("Пользователь", ПользователиКлиент.АвторизованныйПользователь());
	массивСтрок = Новый Массив;
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Номенклатура", "Номенклатура", 2));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Артикул", "Артикул", 3));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Характеристика", "Характеристика", 6));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Штрихкод", "Штрихкод", 7));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Количество", "Количество", 9));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "СтавкаНДС", "Ставка НДС", 10));
	массивСтрок.Добавить(Новый Структура("ИмяПоля, ПредставлениеПоля, НомерКолонки", "Сумма", "Сумма", 25));
	
	ЗначенияЗаполнения.Вставить("СоответствияПолей", массивСтрок);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

#КонецОбласти
